# -*- coding: utf-8 -*-
# author: alex markov - agb2019@list.ru
# license: GNU General Public License
################################################
# -- BETA Version --
###################################################
import sys
import time

from PyQt5 import QtCore, QtWidgets

import modules.search_binary as sb


class RunButton(QtCore.QObject):
    """Класс обработки сигнала кнопки "ВЫПОЛНИТЬ" и "УЗНАТЬ БОЛЬШЕ"
    """

    def __init__(self):
        QtCore.QObject.__init__(self)

    @QtCore.pyqtSlot(bool, name="clickRun")  # слот для обработки
    def clickRun(obj):
        """Функция выполнения результата нажатия "ВЫПОЛНИТЬ"
        """
        ###################################################################
        #start = time.clock()
        print("\n")
        print(sb.binary_search(range(100000), obj.lcdNumber.intValue()))
        #print(str(time.clock() - start) + " секунд на выполнение итераций")
        ####################################################################

    @QtCore.pyqtSlot(bool, name="clickMore")  # слот для обработки
    def clickMore(self):
        """Функция выполнения результата нажатия "УЗНАТЬ БОЛЬШЕ"
        """
        print("\n-----------------------------------------------------------------------------------")
        print("Более подробно Вы можете узнать прочитав главу 'Бинарный поиск' на стр.20-28 книги:")
        print("Бхаргава А. - Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих.")
        print("- СПб.: Питер, 2017. - 288 с. : ил. - (Серия «Библиотека программиста»).")
        print("-----------------------------------------------------------------------------------")
        print("-----------------------------------------------------------------------------------")
        print("Более опытному пользователю можно ознакомиться с двоичным поиском на стр.124-129 книги:")
        print("Хайнеман, Джордж, Пояяис, Гэри, Сеяков, Стэнли.")
        print("Алгоритмы. Справочник с примерами на С, C++, Java и Python, 2-е изд.:")
        print("Пер.с англ. — СпБ.: ООО “Альфа-книга”, 2017. — 432 с .: ил. — Парал. тит. англ.")
        print("-----------------------------------------------------------------------------------")
        print("Данные издания книг доступны приложением к данной программе")


class MyClass():
    """Класс обработки других сигналов
    """

    def __init__(self):
        pass


# Тестирование кнопки clickMore
if __name__ == "__main__":
    obj = RunButton()
    app = QtWidgets.QApplication(sys.argv)
    button = QtWidgets.QPushButton("Нажми меня")
    button.clicked.connect(obj.clickMore)
    button.show()
    sys.exit(app.exec_())
